export enum GAME_STATUS_TYPE {
  OPEN = 'open',
  CLOSE = 'close'
}

/** ****************************************************************************
 * 게임 관련 데이터 정의
 **************************************************************************** */

export interface IGameData {
  name: string
  code: string
  status: GAME_STATUS_TYPE
}

/** ****************************************************************************
 * 게임 관련 엔티티 정의
 **************************************************************************** */

export type IGame = IGameData
